app/controllers/posts_controller.rb

SELECT "authors".* FROM "authors"
---
  def new
    @post = Post.new
    @authors = Author.all

INSERT INTO "posts" ("author_id", "title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author_id", 8], ["title", "Ok"], ["description", "ok"], ["created_at", "2018-03-03 17:44:37.632849"], ["updated_at", "2018-03-03 17:44:37.632849"]]
---
  def create
    @post = Post.create(post_params)